#[rustfmt::skip]
#[rsvz::script]
fn script() {
    use rsvz::core::runtime::{RuntimeError};
    use rsvz::prelude::{CobRuleEditBackend, SunCostRuleEditBackend};

    reload(MainUiOrFightUi);
    // rsvz::setup::set_game_speed(3.0);
    lineup("LI43NJRUU4VkzXZUnp1YRVU=");
    rsvz::with_backend(|backend| {
        backend.set_cob_fixed_delay(true)?;
        backend.set_sun_cost_ignored(true)
    })
        .map_err(|error| RuntimeError::new(error.to_string()))?;
    set_zombies("红白矿梯橄丑杆舞跳篮");
    select_cards("IINAJ", [pot, split, fume, star, grave]);
    // skip_until((12, 1318));
    // skip_until((19, 0));
    rsvz::setup::skip_seed_chooser();

    wave(19);
    ensure_exist("红", 1);

    // 偷菜
    wave(1);
    (-599) << auto_cobs() + dancing() + pot(1, 2) + fume(1, 2) + star(1, 3) + split(1, 5)
        + d(751) + pot(1, 1) + fume(1, 1) + star(1, 4) + split(1, 6);

    wave(9);
    3000 << shovel([(1, 1), (1, 1), (1, 2), (1, 2), (1, 3), (1, 4)])
        + pot(1, 2) + fume(1, 2) + star(1, 3)
        + d(751) + pot(1, 1) + fume(1, 1) + star(1, 4);
    4000 << shovel([(1, 5), (1, 6)]);

    wave(19);
    1500 << shovel([(1, 1), (1, 1), (1, 2), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6)]);

    // 上 F
    wave(1); // PD/PAD
    249 << p(4, 9) + a(4, 9);
    359 << pp()
        + d(107) + p(1, 7.825);

    wave(2); // PSDD-D
    249 << p(33, 9)
        + d(110) + pp()
        + d(107) + p(4, 7.825);
    399 << pot(to(2000), 4, 9) + split(4, 9);
    (601 + 1059) << rm(split, 4, 9);
    400 << fume(to(601 + 1059), 2, 9);
    602 << i(1, 9);

    wave(3); // IP0-P/PSS 1487
    300 << p(3, 9);
    809 << pot(to(1292), 3, 9);
    824 << star(to(1292), 5, 9);
    1060 << split(to(1292), 2, 9) + fume(to(1292), 4, 9);
    1287 << p(1, 8.7875) + p(444, 9)
        + d(211) + mi(1, 7);

    wave(4); // I3Pd/J-PPDd 1711
    581 << j(5, 9) + p(3, 9)
        + d(370) + p(3, 3.5);
    (824 - 751) << pot(to(1282), 3, 9);
    (1075 - 751) << split(to(1074), 3, 9);
    (1133 - 751) << fume(to(1074), 4, 9);
    1075 << split(to(1282), 4, 9);
    824 << pot(to(1074), 5, 9) + star(to(1133), 2, 9)
        + d(751) + star(to(1715), 2, 9) + pot(to(1715), 5, 9);
    1133 << fume(to(1282), 2, 9);
    1511 << pp()
        + d(217) + p(1, 7.1625)
        + d(363 - 217) + p(4, 3.5);

    wave(5); // NPDD
    359 << n(1, 9) + p(4, 9) + split(to(749), 2, 9) + fume(to(749), 5, 9)
        + d(107) + p(24, 7.925);

    wave(6); // PADD
    359 << p(2, 9) + a(4, 9) + star(to(749), 2, 9) + pot(to(584), 5, 9)
        + d(107) + p(2, 7.925) + p(4, 7.825);
    714 << split(to(749), 4, 9);

    wave(7); // PPDD
    362 << pp()
        + d(107) + p(24, 7.8125);
    83 << fume(to(148), 5, 9);
    509 << star(to(580), 2, 9) + pot(to(580), 5, 9);
    602 << i(4, 9);

    wave(8); // I-P/Pd 1526/1525
    824 << star(to(1292), 2, 9) + split(to(1292), 3, 9) + fume(to(1292), 5, 9);
    872 << pot(to(1292), 4, 9);
    1325 << p(4, 9)
        + d(352) + p(4, 2.325);
    1326 << p(2, 8.675)
        + d(211) + mi(1, 7);

    wave(9); // I3-PSJ/IPD-PD/PSD 1075 activate, no fodder
    310 << p(33, 9);
    592 << j(2, 9);
    410 << p(4, 8.7125)
        + d(220) + p(4, 8.575);
    1075 << pp()
        + d(380) + p(4, 3);
    1075 << d(210) + p(2, 9)
        + d(220) + p(1, 9);
    1712 << p(44, 8.7)
        + d(110) + p(24, 8.7);
    1608 << split(keep(5), 2, 9);

    // 下 F
    wave(10); // PDd/AD
    156 << split(1, 5)
        + d(751) + split(1, 6);
    249 << p(2, 9);
    359 << p(2, 9) + a(4, 9)
        + d(265) + p(2, 2.5);
    467 << p(4, 7.8125);

    wave(11); // PD/PSD
    249 << p(44, 9)
        + fume(to(1050 + 601), 3, 9)
        + pot(to(1291 + 601), 5, 9) + star(to(1291 + 601), 5, 9);
    359 << p(42, 9);
    467 << p(1, 7.825);
    602 << mi(1, 7);

    wave(12); // IP-PPSS 1518
    350 << p(4, 8.75);
    800 << split(keep(266), 2, 9);
    1066 << fume(to(1291), 2, 9);
    1051 << star(to(1291), 3, 9);
    751 << pot(to(1291), 4, 9);
    1318 << p(4, 8.575) + p(2, 8.575) + p(33, 9)
        + d(211) + i(1, 7);

    wave(13); // I3-J/PD-PPDD 1687
    106 << j(2, 9);
    430 << p(4, 8.4)
        + d(244) + p(4, 8.525);
    (-16) << pot(to(1282), 3, 9);
    33 << split(to(1282), 3, 9);
    284 << star(to(1074), 2, 9);
    1075 << split(to(1282), 2, 9);
    764 << pot(to(1282), 4, 9);
    800 << fume(keep(266), 5, 9);

    1066 << star(to(1282), 5, 9);
    1487 << p(24, 8.4875)
        + d(220) + p(24, 7.3875);
    1670 << fume(to(1687), 2, 9);

    wave(14); // NDD
    360 << n(3, 9) + split(to(749), 2, 9) + star(to(649), 5, 9);
    359 << d(108) + p(24, 7.825);
    552 << pot(to(649), 4, 9);

    wave(15); // PD/BD
    362 << p(2, 9) + fume(to(590), 2, 9);
    469 << p(2, 7.925);
    255 << p(4, 9)
        + d(110) + p(4, 8.125);
    573 << split(keep(1), 4, 9) + star(keep(1), 5, 9);

    wave(16); // PD/ADD
    260 << a(4, 9);
    386 << p(4, 8.575) + p(2, 9)
        + d(107) + p(4, 8.4)
        + d(19) + p(2, 7.625) + fume(to(601), 2, 9);
    193 << pot(keep(100), 2, 9);
    602 << mi(1, 7);

    wave(17); // I0P-B-PJD/PD 1672
    420 << p(4, 8.4875);
    1075 << p(3, 8.175);
    824 << pot(to(1292), 4, 9) + fume(to(1292), 4, 9) + split(to(1292), 5, 9);
    910 << star(to(1292), 2, 9);
    1472 << p(24, 8.5625)
        + d(213) + i(1, 7)
        + d(7) + p(4, 7.4125) + p(2, 8.6);
    1617 << j(2, 9);

    wave(18); // IP0-PPdd 1275
    467 << p(2, 9);
    724 << pot(to(1075), 2, 9);
    400 << split(to(1075 - 414), 4, 9) + fume(to(1075 - 414), 5, 9);
    1075 << p(24, 8.775)
        + d(370) + p(24, 2.4375);

    wave(19); // PPDDND
    318 << p(24, 8.625)
        + d(303) + n(1, 8);
    433 << p(24, 8.8)
        + d(110) + p(4, 8.8);
    970 << p(5, 9);
    760 << pot(keep(200), 2, 9)
        + d(208) + split(keep(200), 2, 9)
        + d(208) + fume(keep(200), 2, 9)
        + d(208) + star(keep(200), 2, 9);
    1624 << p(3, 9);
    4495 << p(1, 3.425);

    wave(20); // PPSSDD
    249 << p([(2, 8.8), (4, 8.8), (2, 9.0), (4, 9.0)]);
    359 << p(14, 8.9)
        + d(110) + p(24, 8.9125);
    150 << try_card(grave, [(1, 5), (1, 6), (1, 7), (1, 8), (1, 9), (2, 9), (4, 9), (5, 9)]);
    400 << p(1, 6);

}
